/* :ts=8 bk=0
 *
 * i740defs.h:	Bit and structure definitions for Intel-740
 *
 * Leo L. Schwab					1998.07.08
 *
 * Copyright 1998 Be Incorporated.  Confidential unpublished work.
 * All Rights Reserved.
 */
#ifndef	__3DFX_VOODOO4_DEFS_H
#define	__3DFX_VOODOO4_DEFS_H

#ifndef	__BITTWIDDLE_H
#include <graphics_p/3dfx/common/bittwiddle.h>
#endif

#define SSTIOADDR(regName)      ((uint16)offsetof(regs_io, regName))

#define ISET32(addr, value)     outl((uint16) ((uint16) regBase + (uint16) (SSTIOADDR(addr))), value)
#define IGET32(addr)            inl((uint16) ((uint16) regBase + (uint16) (SSTIOADDR(addr))))

#define ISET8PHYS(a,b) {\
uint16 port = (uint16) (regBase) + (uint16) (a);\
outb(port, (uint8) (b));}

#define ISET16PHYS(a,b) {\
uint16 port = (uint16)(regBase) + (uint16)(a);\
outw(port, (uint16) (b));}

#define IGET8PHYS(a) inb((uint16) ((uint16) (regBase) + (uint16) (a)))
#define IGET16PHYS(a) _inpw((uint16) ((uint16) (regBase) + (uint16)(a)))

#define CHECKFORROOM while (! (inb((uint16) regBase) & (uint16)(0x3f)))

#define BIT(n)  (1UL<<(n))

// Banshee Memory Types
#define MEM_TYPE_SGRAM  0
#define MEM_TYPE_SDRAM  1

#define	SIZEOF_CURSORPAGE	0x1000	/* 4 KBytes */
#define SIZEOF_TEXTUREBUFFER (4 << 20) /* 4 Megabytes */
#define SIZEOF_CMDFIFO	0x10000 /* 64 KBytes */

// offsets from the base of memBaseAddr0
#define SST_IO_OFFSET           0x000000
#define SST_CMDAGP_OFFSET       0x080000
#define SST_2D_OFFSET           0x100000
#define SST_3D_OFFSET           0x200000
#define SST_3D_ALT_OFFSET       0x400000
#ifdef H4
#define SST_TEX_OFFSET          0x600000
#define SST_TEX0_OFFSET         0x600000
#define SST_TEX1_OFFSET         0x800000
#define SST_RESERVED_OFFSET     0xA00000
#else
#define SST_TEX_OFFSET          0x600000
#define SST_RESERVED_OFFSET     0x800000
#endif
#define SST_YUV_OFFSET          0xC00000
#define SST_LFB_OFFSET          0x1000000



/*
 * The stupid-ass VGA "standard" decided to place the same register at
 * different offsets depending on whether you were reading or writing it.
 * These two structures define the correct offsets for reads and writes.
 * Then just specify the correct union when reading or writing, and you'll
 * get the right offset.  Poof!
 */
struct vgaregs_read {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_ST01;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	VGA_AR_ValR;		/*  0x03C1			*/
	vuint8	VGA_ST00;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACState;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	VGA_FCR;		/*  0x03CA			*/
	vuint8	__reserved3;		/*	0x03CB			*/
	vuint8	VGA_Misc;		/*  0x03CC			*/
	vuint8	__reserved4;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved5[0x0002];	/*	0x03D0 - 0x03D1		*/
	vuint8	MMX_Idx;		/*  0x03D2			*/
	vuint8	MMX_Val;		/*  0x03D3			*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	XR_Idx;			/*  0x03D6			*/
	vuint8	XR_Val;			/*  0x03D7			*/
	vuint8	__reserved6[0x0002];	/*	0x03D8 - 0x03D9		*/
	vuint8	VGA_ST01;		/*  0x03DA			*/
	vuint8	__reserved7[0x0c25];	/*	0x03DB - 0x0FFF		*/
};

struct vgaregs_write {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_FCR;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	__reserved3;		/*	0x03C1			*/
	vuint8	VGA_Misc;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACRIdx;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	__reserved4;		/*	0x03CA			*/
	vuint8	__reserved5;		/*	0x03CB			*/
	vuint8	__reserved6;		/*	0x03CC			*/
	vuint8	__reserved7;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved8[0x0002];	/*	0x03D0 - 0x03D1		*/
	vuint8	MMX_Idx;		/*  0x03D2			*/
	vuint8	MMX_Val;		/*  0x03D3			*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	XR_Idx;			/*  0x03D6			*/
	vuint8	XR_Val;			/*  0x03D7			*/
	vuint8	__reserved9[0x0002];	/*	0x03D8 - 0x03D9		*/
	vuint8	VGA_FCR;		/*  0x03DA			*/
	vuint8	__reserved10[0x0c25];	/*	0x03DB - 0x0FFF		*/
};
#define	VGA_AR_Idx	VGA_AR_IdxValW
#define	VGA_AR_ValW	VGA_AR_IdxValW


/*
 * Use this union to access the registers based on whether you're reading
 * or writing them.
 */
typedef union vgaregs {
	struct vgaregs_read	r;
	struct vgaregs_write	w;
} vgaregs;



/*
 * The rest of the 3Dfx Banshee registers. 
 */
typedef struct regs_io_struct
{
	/* I/O Register Remap */
	vuint32	status;
	vuint32	pciInit0;
	vuint32	sipMonitor;
	vuint32	lfbMemoryConfig;
	vuint32 miscInit0;
	vuint32 miscInit1;
	vuint32 dramInit0;
	vuint32 dramInit1;
	vuint32 agpInit;
	vuint32 tmuGbeInit;
	vuint32 vgaInit0;
	vuint32 vgaInit1;
	vuint32 dramCommand;
	vuint32 dramData;
	vuint32 _reserved0[1];

	vuint32 vidTvOutBlankVCount;
	
	vuint32 pllCtrl0;
	vuint32 pllCtrl1;
	vuint32 pllCtrl2;
	
	vuint32 dacMode;
	vuint32 dacAddr;
	vuint32 dacData;
	
	vuint32 vidMaxRGBDelta;
	vuint32 vidProcCfg;
	vuint32 hwCurPatAddr;
	vuint32 hwCurLoc;
	vuint32 hwCurC0;
