/* :ts=8 bk=0
 *
 * i740defs.h:	Bit and structure definitions for Intel-740
 *
 * Leo L. Schwab					1998.07.08
 *
 * Copyright 1998 Be Incorporated.  Confidential unpublished work.
 * All Rights Reserved.
 */
#ifndef	__I740DEFS_H
#define	__I740DEFS_H

#ifndef	__BITTWIDDLE_H
#include "bittwiddle.h"
#endif


/*
 * The stupid-ass VGA "standard" decided to place the same register at
 * different offsets depending on whether you were reading or writing it.
 * These two structures define the correct offsets for reads and writes.
 * Then just specify the correct union when reading or writing, and you'll
 * get the right offset.  Poof!
 */
struct vgaregs_read {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_ST01;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	VGA_AR_ValR;		/*  0x03C1			*/
	vuint8	VGA_ST00;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACState;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	VGA_FCR;		/*  0x03CA			*/
	vuint8	__reserved3;		/*	0x03CB			*/
	vuint8	VGA_Misc;		/*  0x03CC			*/
	vuint8	__reserved4;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved5[0x0002];	/*	0x03D0 - 0x03D1		*/
	vuint8	MMX_Idx;		/*  0x03D2			*/
	vuint8	MMX_Val;		/*  0x03D3			*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	XR_Idx;			/*  0x03D6			*/
	vuint8	XR_Val;			/*  0x03D7			*/
	vuint8	__reserved6[0x0002];	/*	0x03D8 - 0x03D9		*/
	vuint8	VGA_ST01;		/*  0x03DA			*/
	vuint8	__reserved7[0x0c25];	/*	0x03DB - 0x0FFF		*/
};

struct vgaregs_write {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_FCR;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	__reserved3;		/*	0x03C1			*/
	vuint8	VGA_Misc;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACRIdx;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	__reserved4;		/*	0x03CA			*/
	vuint8	__reserved5;		/*	0x03CB			*/
	vuint8	__reserved6;		/*	0x03CC			*/
	vuint8	__reserved7;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved8[0x0002];	/*	0x03D0 - 0x03D1		*/
	vuint8	MMX_Idx;		/*  0x03D2			*/
	vuint8	MMX_Val;		/*  0x03D3			*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	XR_Idx;			/*  0x03D6			*/
	vuint8	XR_Val;			/*  0x03D7			*/
	vuint8	__reserved9[0x0002];	/*	0x03D8 - 0x03D9		*/
	vuint8	VGA_FCR;		/*  0x03DA			*/
	vuint8	__reserved10[0x0c25];	/*	0x03DB - 0x0FFF		*/
};
#define	VGA_AR_Idx	VGA_AR_IdxValW
#define	VGA_AR_ValW	VGA_AR_IdxValW


/*
 * Use this union to access the registers based on whether you're reading
 * or writing them.
 */
typedef union vgaregs {
	struct vgaregs_read	r;
	struct vgaregs_write	w;
} vgaregs;



/*
 * The rest of the I740 registers.  I haven't settled on all the names yet.
 */
typedef struct I740Regs {
	union vgaregs	VGARegs;		/*  0x00000 - 0x00FFF	*/

	/*  Instruction and Interrupt Control  */
	vuint32		LPFIFO[0x0400];		/*  0x01000 - 0x01FFF	*/
	vuint32		HPFIFO[0x0400];		/*  0x02000 - 0x02FFF	*/
	vuint32		LMFT[7];		/*  0x03000 - 0x0301B	*/
	vuint32		__reserved0;		/*  0x0301C - 0x0301F	*/
	vuint32		INPEIR;			/*  0x03020 - 0x03023	*/
	vuint32		NOPID;			/*  0x03024 - 0x03027	*/
	vuint32		HWSTVA;			/*  0x03028 - 0x0302B	*/
	vuint16		HWSTM;			/*  0x0302C - 0x0302D	*/
	vuint16		__reserved1;		/*  0x0302E - 0x0302F	*/
	vuint16		IER;			/*  0x03030 - 0x03031	*/
	vuint16		IIR;			/*  0x03032 - 0x03033	*/
	vuint16		IMR;			/*  0x03034 - 0x03035	*/
	vuint16		ISR;			/*  0x03036 - 0x03037	*/
	vuint8		INPMODE;		/*  0x03038		*/
	vuint8		INSTMASK;		/*  0x03039		*/
	vuint16		__reserved2;		/*  0x0303A - 0x0303B	*/
	vuint32		PIOFLUSH;		/*  0x0303C - 0x0303F	*/
	vuint16		INPOINT;		/*  0x03040 - 0x03041	*/
	vuint16		INPARS;			/*  0x03042 - 0x03043	*/
	vuint32		DMAPARP;		/*  0x03044 - 0x03047	*/
	vuint32		DMAADR;			/*  0x03048 - 0x0304B	*/
	vuint16		THREEDSKEW;		/*  0x0304C - 0x0304D	*/
	vuint16		BLTSKEW;		/*  0x0304E - 0x0304F	*/
	vuint32		MAGP_HC_COMP;		/*  0x03050 - 0x03053	*/
	vuint32		AGP_QD_COMP;		/*  0x03054 - 0x03057	*/
	vuint8		__reserved3[0x2FA8];	/*  0x03058 - 0x05FFF	*/
	vuint32		FWATER_BLC;		/*  0x06000 - 0x06003	*/
	vuint8		__reserved4[0x0FFC];	/*  0x06004 - 0x06FFF	*/

	/*  DVD  */
	vuint32		DVDMAP[0x0040];		/*  0x07000 - 0x070FF	*/
	vuint32		DVDDMA;			/*  0x07100 - 0x07103	*/
	vuint32		__reserved5;		/*  0x07104 - 0x07107	*/
	vuint32		DDBADDR;		/*  0x07108 - 0x0710B	*/
	vuint32		__reserved6;		/*  0x0710C - 0x0710F	*/
	vuint32		DBURSTDST;		/*  0x07110 - 0x07113	*/
	vuint32		DHOSTCTL;		/*  0x07114 - 0x07117	*/
	vuint16		DHOSTSTA;		/*  0x07118 - 0x07119	*/
	vuint8		__reserved7[0x38EE6];	/*  0x0711A - 0x3FFFF	*/

/*******
 * WARNING:
 * HAZARDOUS REGISTERS
 * THE CPU MUST NOT WRITE TO ANY OF THESE REGISTERS.  USE ONLY I740 DMA
 * "INSTRUCTIONS" TO WRITE TO THIS SPACE.  Reads are (mostly) safe.
 */
	/*  BLT  */
	vuint32		BLT_Pitches;		/*  0x40000 - 0x40003	*/
	vuint32		BLT_PatBGColor;		/*  0x40004 - 0x40007	*/
	vuint32		BLT_PatFGColor;		/*  0x40008 - 0x4000B	*/
	vuint32		BLT_MonoSrcCtl;		/*  0x4000C - 0x4000F	*/
	vuint32		BLT_BlitCtl;		/*  0x40010 - 0x40013	*/
	vuint32		BLT_PatSrcAddr;		/*  0x40014 - 0x40017	*/
	vuint32		BLT_SrcAddr;		/*  0x40018 - 0x4001B	*/
	vuint32		BLT_DstAddr;		/*  0x4001C - 0x4001F	*/
	vuint32		BLT_DstSize;		/*  0x40020 - 0x40023	*/
	vuint32		BLT_SrcBGColor;		/*  0x40024 - 0x40027	*/
	vuint32		BLT_SrcFGColor;		/*  0x40028 - 0x4002B	*/
	vuint8		__reserved8[0x00D4];	/*  0x4002C - 0x400FF	*/

	/*  Stretch BLT  */
	vuint32		SBLT_SrcAddr;		/*  0x40100 - 0x40103	*/
	vuint32		SBLT_SrcWidth;		/*  0x40104 - 0x40107	*/
	vuint32		SBLT_SrcHeightCtl;	/*  0x40108 - 0x4010B	*/
	vuint32		SBLT_DstAddr;		/*  0x4010C - 0x4010F	*/
	vuint32		SBLT_DstWidth;		/*  0x40110 - 0x40113	*/
	vuint32		SBLT_DstHeightCtl;	/*  0x40114 - 0x40117	*/
	vuint32		SBLT_HFactor;		/*  0x40118 - 0x4011B	*/
	vuint32		SBLT_VFactor;		/*  0x4011C - 0x4011F	*/
	vuint32		SBLT_DDAPhase;		/*  0x40120 - 0x40123	*/
	vuint32		SBLT_Status;		/*  0x40124 - 0x40127	*/
	vuint32		SBLT_SrcMask;		/*  0x40128 - 0x4012B	*/
	vuint32		SBLT_SrcCmpColorMin;	/*  0x4012C - 0x4012F	*/
	vuint32		SBLT_SrcCmpColorMax;	/*  0x40130 - 0x40133	*/
	vuint32		SBLT_DstCmpColorMin;	/*  0x40134 - 0x40137	*/
	vuint32		SBLT_DstCmpColorMax;	/*  0x40138 - 0x4013B	*/
	vuint32		SBLT_Start;		/*  0x4013C - 0x4013F	*/
	vuint8		__reserved9[0xFEC0];	/*  0x40140 - 0x4FFFF	*/

	vuint32		BLTDATA[0x4000];	/*  0x50000 - 0x5FFFF	*/
	vuint32		SBLTDATA[0x4000];	/*  0x60000 - 0x6FFFF	*/
/*
 * End of hazardous registers.
 ******/

	/*  Multimedia Event Counter Interrupt Registers  */
	vuint32		CHI_CNT_CMP;		/*  0x70000 - 0x70003	*/
	vuint32		CHI_CNTL;		/*  0x70004 - 0x70007	*/
	vuint32		CHI_ACK_CNT;		/*  0x70008 - 0x7000B	*/
	vuint8		__reserved10[0x0014];	/*  0x7000C - 0x7001F	*/
	vuint32		DHI_CNT_CMP;		/*  0x70020 - 0x70023	*/
	vuint32		DECC;			/*  0x70024 - 0x70027	*/
	vuint32		DHI_ACK_CNT;		/*  0x70028 - 0x7002B	*/
	vuint8		__reserved11[0xFFD4];	/*  0x7002C - 0x7FFFF	*/
} I740Regs;


/*****************************************************************************
 * "Standard" VGA register indices and bit definitions.
 ****
 * Sequencer bit and index definitions
 * I've decided to use the XFree86/NVidia bit definition form, even though
 * it makes the use of ctags difficult.
 */
#define	SR_RESET				0x00
#define	SR_RESET_SYNC				1:1
#define	SR_RESET_SYNC_ENABLE			0
#define	SR_RESET_SYNC_DISABLE			1
#define	SR_RESET_ASYNC				0:0
#define	SR_RESET_ASYNC_ENABLE			0
#define	SR_RESET_ASYNC_DISABLE			1

#define	SR_CLOCK				0x01
#define	SR_CLOCK_VIDDISABLE			5:5
#define	SR_CLOCK_SHIFTLOAD4			4:4
#define	SR_CLOCK_SHIFTLOAD4_1			0
#define	SR_CLOCK_SHIFTLOAD4_4			1
#define	SR_CLOCK_CLKDIV				3:3
#define	SR_CLOCK_CLKDIV_DIV1			0
#define	SR_CLOCK_CLKDIV_DIV2			1
#define	SR_CLOCK_SHIFTLOAD2			2:2
#define	SR_CLOCK_SHIFTLOAD2_1			0
#define	SR_CLOCK_SHIFTLOAD2_2			1
#define	SR_CLOCK_TXCELLWIDTH			0:0
