/* :ts=8 bk=0
 *
 * lynxemdefs.h:	Bit and structure definitions for the LynxEM.
 *
 * Leo L. Schwab					2000.07.06
 *
 * Copyright 1999 Be Incorporated.
 */
#ifndef	__LYNXEMDEFS_H
#define	__LYNXEMDEFS_H

#ifndef	__BITTWIDDLE_H
#include "bittwiddle.h"
#endif


/*
 * The stupid-ass VGA "standard" decided to place the same register at
 * different offsets depending on whether you were reading or writing it.
 * These two structures define the correct offsets for reads and writes.
 * Then just specify the correct union when reading or writing, and you'll
 * get the right offset.  Poof!
 */
struct vgaregs_read {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_ST01;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	VGA_AR_ValR;		/*  0x03C1			*/
	vuint8	VGA_ST00;		/*  0x03C2			*/
	vuint8	VGA_Lock;		/*  0x03C3			*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACState;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	VGA_FCR;		/*  0x03CA			*/
	vuint8	__reserved3;		/*	0x03CB			*/
	vuint8	VGA_Misc;		/*  0x03CC			*/
	vuint8	__reserved4;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved5[0x0004];	/*	0x03D0 - 0x03D3		*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	__reserved6[0x0004];	/*	0x03D6 - 0x03D9		*/
	vuint8	VGA_ST01;		/*  0x03DA			*/
	vuint8	__reserved7[0x0c25];	/*	0x03DB - 0x0FFF		*/
};

struct vgaregs_write {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_FCR;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	__reserved3;		/*	0x03C1			*/
	vuint8	VGA_Misc;		/*  0x03C2			*/
	vuint8	VGA_Lock;		/*  0x03C3			*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACRIdx;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	__reserved4;		/*	0x03CA			*/
	vuint8	__reserved5;		/*	0x03CB			*/
	vuint8	__reserved6;		/*	0x03CC			*/
	vuint8	__reserved7;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved8[0x0004];	/*	0x03D0 - 0x03D3		*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	__reserved9[0x0004];	/*	0x03D6 - 0x03D9		*/
	vuint8	VGA_FCR;		/*  0x03DA			*/
	vuint8	__reserved10[0x0c25];	/*	0x03DB - 0x0FFF		*/
};
#define	VGA_AR_Idx	VGA_AR_IdxValW
#define	VGA_AR_ValW	VGA_AR_IdxValW


/*
 * Use this union to access the registers based on whether you're reading
 * or writing them.
 */
typedef union vgaregs {
	struct vgaregs_read	r;
	struct vgaregs_write	w;
} vgaregs;


/*
 * Drawing Processor registers (memory-mapped)
 */
typedef struct DPRegs {
	vuint32	SrcXY;				/*  0x00000 - 0x00003	*/
	vuint32	DestXY;				/*  0x00004 - 0x00007	*/
	vuint32	Size;				/*  0x00008 - 0x0000B	*/
	vuint32	DrawCtl;			/*  0x0000C - 0x0000F	*/
	vuint32	Pitches;			/*  0x00010 - 0x00013	*/
	vuint32	FGColor;			/*  0x00014 - 0x00017	*/
	vuint32	BGColor;			/*  0x00018 - 0x0001B	*/
	vuint32	DataFmt;			/*  0x0001C - 0x0001F	*/
	vuint32	CmpColor;			/*  0x00020 - 0x00023	*/
	vuint32	CmpMask;			/*  0x00024 - 0x00027	*/
	vuint32	MaskEnable;			/*  0x00028 - 0x0002B	*/
	vuint32	ScisTopLeftCtl;			/*  0x0002C - 0x0002F	*/
	vuint32	ScisBotRight;			/*  0x00030 - 0x00033	*/
	vuint32	MonoPat[2];			/*  0x00034 - 0x0003B	*/
	vuint32	WinWidth;			/*  0x0003C - 0x0003F	*/
	vuint32	SrcAddr;			/*  0x00040 - 0x00043	*/
	vuint32	DestAddr;			/*  0x00044 - 0x00047	*/
} DPRegs;


/*
 * Video Processor (overlay) registers (memory-mapped)
 */
typedef struct VPRegs {
	vuint32	GrVidCtl;			/*  0x00000 - 0x00003	*/
	vuint32	ColorKey;			/*  0x00004 - 0x00007	*/
	vuint32	ColorMask;			/*  0x00008 - 0x0000B	*/
	vuint32	FBBase;				/*  0x0000C - 0x0000F	*/
	vuint32	FBWidthPitch;			/*  0x00010 - 0x00013	*/
	struct {
		vuint32	TopLeft;	/*  0x00000 - 0x00003	*/
		vuint32	BottomRight;	/*  0x00004 - 0x00007	*/
		vuint32	SrcAddr;	/*  0x00008 - 0x0000B	*/
		vuint32	SrcWidthPitch;	/*  0x0000C - 0x0000F	*/
		vuint32	ScaleLo;	/*  0x00010 - 0x00013	*/
	} WinCfg[2];				/*  0x00014 - 0x0003B	*/
	vuint32	GrVidCtl2;			/*  0x0003C - 0x0003F	*/
	vuint32	ScaleFactor;			/*  0x00040 - 0x00043	*/
	vuint32	__reserved[4];			/*  0x00044 - 0x00053	*/
	vuint32	FIFOPri;			/*  0x00054 - 0x00057	*/
	vuint32	FIFOReq;			/*  0x00058 - 0x0005B	*/
	vuint32	YUV2RGBConst;			/*  0x0005C - 0x0005F	*/
	vuint32	CurScanLine;			/*  0x00060 - 0x00063	*/
	vuint32	SigAnalyzer;			/*  0x00064 - 0x00067	*/
	vuint32	Win1Scale;			/*  0x00068 - 0x0006B	*/
	vuint32	Win2Scale;			/*  0x0006C - 0x0006F	*/
} VPRegs;


/*
 * Capture Processor registers (memory-mapped)
 */
typedef struct CPRegs {
	vuint32	Ctl;				/*  0x00000 - 0x00003	*/
	vuint32	SrcClip;			/*  0x00004 - 0x00007	*/
	vuint32	SrcSize;			/*  0x00008 - 0x0000B	*/
	vuint32	Buf1Addr;			/*  0x0000C - 0x0000F	*/
	vuint32	Buf2Addr;			/*  0x00010 - 0x00013	*/
	vuint32	PortSrcAddr;			/*  0x00014 - 0x00017	*/
	vuint32	FIFOReq;			/*  0x00018 - 0x0001B	*/
} CPRegs;


/*
 * The LynxEM is a graphics chip with embedded framebuffer RAM.  The common
 * trick on such chips is to declare only one PCI aperture, place the
 * framebuffer RAM at offset zero, and the control registers at offset N,
 * where N varies from chip to chip.  In the case of the LynxEM, the memory
 * map is as follows:
 *
 *	+---------------+ 0x000000 (0M)
 *	|  Framebuffer  | (Actual end of usable RAM may be earlier.)
 *	|    Memory     |
 *	+---------------+ 0x400000 (4M)
 *	|    Drawing    |
 *	| Processor Data|
 *	+---------------+ 0x408000 (4M + 32K)
 *	|    Drawing    |
 *	| Processor Regs|
 *	+---------------+ 0x40C000 (4M + 48K)
 *	|     Video     |
 *	| Processor Regs|
 *	+---------------+ 0x40E000 (4M + 56K)
 *	|    Capture    |
 *	| Processor Regs|
 *	+---------------+ 0x410000 (4M + 64K)
 *	|    <unused>   |
 *	+---------------+ 0x500000 (5M)
 *	|   Additional  |
 *	|  DP Data Port |
