/* :ts=8 bk=0
 *
 * i810.h:	Bit and structure definitions for Intel 810.
 *
 * Leo L. Schwab					1999.10.25
 *
 * Copyright 1999 Be Incorporated.
 */
#ifndef	__I810DEFS_H
#define	__I810DEFS_H

#ifndef	__BITTWIDDLE_H
#include "bittwiddle.h"
#endif


/*
 * The stupid-ass VGA "standard" decided to place the same register at
 * different offsets depending on whether you were reading or writing it.
 * These two structures define the correct offsets for reads and writes.
 * Then just specify the correct union when reading or writing, and you'll
 * get the right offset.  Poof!
 */
struct vgaregs_read {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_ST01;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	VGA_AR_ValR;		/*  0x03C1			*/
	vuint8	VGA_ST00;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACState;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	VGA_FCR;		/*  0x03CA			*/
	vuint8	__reserved3;		/*	0x03CB			*/
	vuint8	VGA_Misc;		/*  0x03CC			*/
	vuint8	__reserved4;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved5[0x0002];	/*	0x03D0 - 0x03D1		*/
	vuint8	MMX_Idx;		/*  0x03D2			*/
	vuint8	MMX_Val;		/*  0x03D3			*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	__reserved6[0x0004];	/*	0x03D6 - 0x03D9		*/
	vuint8	VGA_ST01;		/*  0x03DA			*/
	vuint8	__reserved7[0x0c25];	/*	0x03DB - 0x0FFF		*/
};

struct vgaregs_write {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_FCR;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	__reserved3;		/*	0x03C1			*/
	vuint8	VGA_Misc;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACRIdx;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	__reserved4;		/*	0x03CA			*/
	vuint8	__reserved5;		/*	0x03CB			*/
	vuint8	__reserved6;		/*	0x03CC			*/
	vuint8	__reserved7;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved8[0x0002];	/*	0x03D0 - 0x03D1		*/
	vuint8	MMX_Idx;		/*  0x03D2			*/
	vuint8	MMX_Val;		/*  0x03D3			*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	__reserved9[0x0004];	/*	0x03D6 - 0x03D9		*/
	vuint8	VGA_FCR;		/*  0x03DA			*/
	vuint8	__reserved10[0x0c25];	/*	0x03DB - 0x0FFF		*/
};
#define	VGA_AR_Idx	VGA_AR_IdxValW
#define	VGA_AR_ValW	VGA_AR_IdxValW


/*
 * Use this union to access the registers based on whether you're reading
 * or writing them.
 */
typedef union vgaregs {
	struct vgaregs_read	r;
	struct vgaregs_write	w;
} vgaregs;


/*
 * Ring buffer, for DMAd command sequences.
 */
typedef struct RingBuffer {
	vuint32	RINGBUF0;	/*  Tail offset and control	*/
	vuint32	RINGBUF1;	/*  Head offset			*/
	vuint32	RINGBUF2;	/*  Base address		*/
	vuint32	RINGBUF3;	/*  Buffer size			*/
} RingBuffer;


/*
 * HW status page layout.
 */
typedef struct HWStatusPage {
	vuint32	IRQStatus;			/*  0x00000 - 0x00003	*/
	vuint32	LPRingHead;			/*  0x00004 - 0x00007	*/
	vuint32	IRQRingHead;			/*  0x00008 - 0x0000B	*/
	vuint32	_IntelReserved;			/*  0x0000C - 0x0000F	*/
	/*  Defined by driver.  */
	vuint32	__reserved[0x03F7];		/*  0x00010 - 0x00FEB	*/
	vuint32	ExecutionFlags[4];		/*  0x00FEC - 0x00FFB	*/
	vuint32	PrimitiveCookie;		/*  0x00FFC - 0x00FFF   */
} HWStatusPage;


/*
 * Video overlay registers (set up in memory, then read via DMA).
 */
typedef struct OverlayRegs {
	vuint32		OBUF_0Y;		/*  0x00000 - 0x00003	*/
	vuint32		OBUF_1Y;		/*  0x00000 - 0x00003	*/
	vuint32		OBUF_0U;		/*  0x00000 - 0x00003	*/
	vuint32		OBUF_0V;		/*  0x00000 - 0x00003	*/
	vuint32		OBUF_1U;		/*  0x00010 - 0x00013	*/
	vuint32		OBUF_1V;		/*  0x00014 - 0x00017	*/
	vuint32		OV0STRIDE;		/*  0x00018 - 0x0001B	*/
	vuint32		YRGB_VPH;		/*  0x0001C - 0x0001F	*/
	vuint32		UV_VPH;			/*  0x00020 - 0x00023	*/
	vuint32		HORZ_PH;		/*  0x00024 - 0x00027	*/
	vuint32		INIT_PH;		/*  0x00028 - 0x0002B	*/
	vuint32		DWINPOS;		/*  0x0002C - 0x0002F	*/
	vuint32		DWINSZ;			/*  0x00030 - 0x00033	*/
	vuint32		SWID;			/*  0x00034 - 0x00037	*/
	vuint32		SWIDQW;			/*  0x00038 - 0x0003B	*/
	vuint32		SHEIGHT;		/*  0x0003C - 0x0003F	*/
	vuint32		YRGBSCALE;		/*  0x00040 - 0x00043	*/
	vuint32		UVSCALE;		/*  0x00044 - 0x00047	*/
	vuint32		OV0CLRC0;		/*  0x00048 - 0x0004B	*/
	vuint32		OV0CLRC1;		/*  0x0004C - 0x0004F	*/
	vuint32		DCLRKV;			/*  0x00050 - 0x00053	*/
	vuint32		DCLRKM;			/*  0x00054 - 0x00057	*/
	vuint32		SCLRKVH;		/*  0x00058 - 0x0005B	*/
	vuint32		SCLRKVL;		/*  0x0005C - 0x0005F	*/
	vuint32		SCLRKM;			/*  0x00060 - 0x00063	*/
	vuint32		OV0CONF;		/*  0x00064 - 0x00067	*/
	vuint32		OV0CMD;			/*  0x00068 - 0x0006B	*/
	vuint32		__reserved0;		/*  0x0006C - 0x0006F	*/
	vuint32		AWINPOS;		/*  0x00070 - 0x00073	*/
	vuint32		AWINZ;			/*  0x00074 - 0x00077	*/
	vuint32		__reserved1[2];		/*  0x00078 - 0x0007F	*/
} OverlayRegs;



/*
 * The rest of the I810 registers.  I haven't settled on all the names yet.
 */
typedef struct I810Regs {
	union vgaregs	VGARegs;		/*  0x00000 - 0x00FFF	*/

	/*  Instruction and Interrupt Control  */
	vuint32		DMAFIFO[0x0400];	/*  0x01000 - 0x01FFF	*/
	vuint32		FENCE[8];		/*  0x02000 - 0x0201F	*/
	vuint32		PGTBL_CTL;		/*  0x02020 - 0x02023	*/
	vuint32		PGTBL_ERR;		/*  0x02024 - 0x02027	*/
	vuint32		__reserved0[2];		/*  0x02028 - 0x0202F	*/
	RingBuffer	LPRING;			/*  0x02030 - 0x0203F	*/
	RingBuffer	IRQRING;		/*  0x02040 - 0x0204F	*/
	vuint32		__reserved00[12];	/*  0x02050 - 0x0207F	*/
	vuint32		HWS_PGA;		/*  0x02080 - 0x02083	*/
	vuint32		__reserved1;		/*  0x02084 - 0x02087	*/
	vuint32		IPEIR;			/*  0x02088 - 0x0208B	*/
	vuint32		IPEHR;			/*  0x0208C - 0x0208F	*/
	vuint16		INSTDONE;		/*  0x02090 - 0x02091	*/
	vuint16		__reserved2;		/*  0x02092 - 0x02093	*/
	vuint32		NOPID;			/*  0x02094 - 0x02097	*/
	vuint16		HWSTAM;			/*  0x02098 - 0x02099	*/
	vuint16		__reserved3[3];		/*  0x0209A - 0x0209F	*/
	vuint16		IER;			/*  0x020A0 - 0x020A1	*/
	vuint16		__reserved4;		/*  0x020A2 - 0x020A3	*/
	vuint16		IIR;			/*  0x020A4 - 0x020A5	*/
	vuint16		__reserved5;		/*  0x020A6 - 0x020A7	*/
	vuint16		IMR;			/*  0x020A8 - 0x020A9	*/
	vuint16		__reserved6;		/*  0x020AA - 0x020AB	*/
	vuint16		ISR;			/*  0x020AC - 0x020AD	*/
	vuint16		__reserved7;		/*  0x020AE - 0x020AF	*/
	vuint16		EIR;			/*  0x020B0 - 0x020B1	*/
	vuint16		__reserved8;		/*  0x020B2 - 0x020B3	*/
	vuint16		EMR;			/*  0x020B4 - 0x020B5	*/
	vuint16		__reserved9;		/*  0x020B6 - 0x020B7	*/
	vuint16		ESR;			/*  0x020B8 - 0x020B9	*/
	vuint16		__reserved10;		/*  0x020BA - 0x020BB	*/
	vuint32		__reserved11;		/*  0x020BC - 0x020BF	*/
	vuint8		INSTPM;			/*  0x020C0          	*/
	vuint8		__reserved12[3];	/*  0x020C1 - 0x020C3	*/
	vuint32		INSTPS;			/*  0x020C4 - 0x020C7	*/
	vuint32		BBP_PTR;		/*  0x020C8 - 0x020CB	*/
	vuint32		ABB_SRT;		/*  0x020CC - 0x020CF	*/
	vuint32		ABB_END;		/*  0x020D0 - 0x020D3	*/
	vuint32		DMA_FADD;		/*  0x020D4 - 0x020D7	*/
	vuint32		FW_BLC;			/*  0x020D8 - 0x020DB	*/
	vuint32		MEM_MODE;		/*  0x020DC - 0x020DF	*/
	vuint8		__reserved13[0x0F20];	/*  0x020E0 - 0x02FFF	*/

	/*  Memory control registers  */
	vuint8		DRT;			/*  0x03000          	*/
	vuint8		DRAMCL;			/*  0x03001          	*/
	vuint8		DRAMCH;			/*  0x03002          	*/
	vuint8		__reserved14[0x0FFD];	/*  0x03003 - 0x03FFF	*/

	/*  Span cursor registers (?)  */
	vuint32		__reserved15[2];	/*  0x04000 - 0x04007	*/
	vuint32		UI_SC_CTL;		/*  0x04008 - 0x0400B	*/
	vuint8		__reserved16[0x0FF4];	/*  0x0400C - 0x04FFF	*/

	/*  I/O control registers  */
	vuint32		HVSYNC;			/*  0x05000 - 0x05003	*/
	vuint32		__reserved17[3];	/*  0x05004 - 0x0500F	*/
	vuint32		GPIOA;			/*  0x05010 - 0x05013	*/
	vuint32		GPIOB;			/*  0x05014 - 0x05017	*/
	vuint8		__reserved18[0x0FE8];	/*  0x05018 - 0x05FFF	*/

	/*  Clock control and power management registers  */
	vuint32		DCLK_MN0;		/*  0x06000 - 0x06003	*/
	vuint32		DCLK_MN1;		/*  0x06004 - 0x06007	*/
	vuint32		DCLK_MN2;		/*  0x06008 - 0x0600B	*/
	vuint32		DCLK_MNLCD;		/*  0x0600C - 0x0600F	*/
	vuint8		DCLK_P0;		/*  0x06010		*/
	vuint8		DCLK_P1;		/*  0x06011		*/
	vuint8		DCLK_P2;		/*  0x06012		*/
	vuint8		DCLK_PLCD;		/*  0x06013		*/
	vuint32		PWR_CLKC;		/*  0x06014 - 0x06017	*/
	vuint8		__reserved19[0x9FE8];	/*  0x06018 - 0x0FFFF	*/

	/*  Graphics translation table  */
	vuint32		GTT[0x4000];		/*  0x10000 - 0x1FFFF	*/
	vuint32		__reserved20[0x4000];	/*  0x20000 - 0x2FFFF	*/

	/*  Overlay registers  */
	vuint32		OV0ADDR;		/*  0x30000 - 0x30003	*/
	vuint32		__reserved21;		/*  0x30004 - 0x30003	*/
	vuint32		DOV0STA;		/*  0x30008 - 0x30003	*/
	vuint32		__reserved22;		/*  0x3000C - 0x30003	*/
	vuint32		GAMMA[6];		/*  0x30010 - 0x30027	*/
	vuint32		__reserved23[0x0036];	/*  0x30028 - 0x300FF	*/
	OverlayRegs	OV;			/*  0x30100 - 0x3017F	*/
	vuint8		__reserved25[0xFE80];	/*  0x30180 - 0x3FFFF	*/

	/*  BLT engine status.  CPU can't write to these regs.  */
	vuint32		BLT_OpcodeCtl;		/*  0x40000 - 0x40003	*/
	vuint32		BLT_SetupCtl;		/*  0x40000 - 0x40007	*/
	vuint32		BLT_ClipY1;		/*  0x40000 - 0x4000B	*/
	vuint32		BLT_ClipY2;		/*  0x40000 - 0x4000F	*/
	vuint32		BLT_ClipX1X2;		/*  0x40010 - 0x40013	*/
	vuint32		BLT_SetupBGColor;	/*  0x40014 - 0x40017	*/
	vuint32		BLT_SetupFGColor;	/*  0x40018 - 0x4001B	*/
	vuint32		BLT_SetupColorPatAddr;	/*  0x4001C - 0x4001F	*/
	vuint32		BLT_DestX1X2;		/*  0x40020 - 0x40023	*/
	vuint32		BLT_DestY1;		/*  0x40024 - 0x40027	*/
	vuint32		BLT_DestY2;		/*  0x40028 - 0x4002B	*/
	vuint32		BLT_SrcPitchStatus;	/*  0x4002C - 0x4002F	*/
	vuint32		BLT_SrcAddr;		/*  0x40030 - 0x40033	*/
	vuint32		BLT_Ctl;		/*  0x40034 - 0x40037	*/
	vuint32		BLT_DestDims;		/*  0x40038 - 0x4003B	*/
	vuint32		BLT_ColorPatAddr;	/*  0x4003C - 0x4003F	*/
	vuint32		BLT_PatBGColor;		/*  0x40040 - 0x40043	*/
	vuint32		BLT_PatFGColor;		/*  0x40044 - 0x40047	*/
	vuint32		BLT_SrcBGColor;		/*  0x40048 - 0x4004B	*/
	vuint32		BLT_SrcFGColor;		/*  0x4004C - 0x4004F	*/
	vuint32		__reserved26[0x3FEC];	/*  0x40050 - 0x4FFFF	*/
	vuint32		__reserved27[0x4000];	/*  0x50000 - 0x5FFFF	*/

	/*  LCD/TV-out and DVD registers  */
	vuint32		LCD_HTotal;		/*  0x60000 - 0x60003	*/
	vuint32		LCD_HBlank;		/*  0x60004 - 0x60007	*/
	vuint32		LCD_HSync;		/*  0x60008 - 0x6000B	*/
	vuint32		LCD_VTotal;		/*  0x6000C - 0x6000F	*/
	vuint32		LCD_VBlank;		/*  0x60010 - 0x60013	*/
	vuint32		LCD_VSync;		/*  0x60014 - 0x60017	*/
	vuint32		LCD_Ctl;		/*  0x60018 - 0x6001B	*/
	vuint32		LCD_OverlayActive;	/*  0x6001C - 0x6001F	*/
	vuint32		LCD_BorderColor;	/*  0x60020 - 0x60023	*/
	vuint8		__reserved28[0xFFDC];	/*  0x60024 - 0x6FFFF	*/

	/*  Display and cursor control registers  */
	vuint32		DISP_SL;		/*  0x70000 - 0x70003	*/
	vuint32		DISP_SLC;		/*  0x70004 - 0x70007	*/
	vuint32		PIXCONF;		/*  0x70008 - 0x7000B	*/
	vuint32		BLTCTL;			/*  0x7000C - 0x7000F	*/
	vuint32		__reserved29;		/*  0x70010 - 0x70013	*/
	vuint32		SWF[3];			/*  0x70014 - 0x7001F	*/
	vuint32		DISPBASE;		/*  0x70020 - 0x70023	*/
	vuint32		DISPSTAS;		/*  0x70024 - 0x70027	*/
	vuint8		__reserved30[0x0058];	/*  0x70028 - 0x7007F	*/
	vuint32		CURSCTL;		/*  0x70080 - 0x70083	*/
	vuint32		CURSBASE;		/*  0x70084 - 0x70087	*/
	vuint32		CURSPOS;		/*  0x70088 - 0x7008B	*/
	vuint8		__reserved31[0xFF74];	/*  0x7008C - 0x7FFFF	*/
} I810Regs;


/*****************************************************************************
 * "Standard" VGA register indices and bit definitions.
 ****
 * Sequencer bit and index definitions
 * I've decided to use the XFree86/NVidia bit definition form, even though
 * it makes the use of ctags difficult.
 */
#define	SR_RESET				0x00
#define	SR_RESET_SYNC				1:1
#define	SR_RESET_SYNC_ENABLE			0
#define	SR_RESET_SYNC_DISABLE			1
#define	SR_RESET_ASYNC				0:0
#define	SR_RESET_ASYNC_ENABLE			0
#define	SR_RESET_ASYNC_DISABLE			1

#define	SR_CLOCK				0x01
#define	SR_CLOCK_VIDDISABLE			5:5
#define	SR_CLOCK_SHIFTLOAD4			4:4
#define	SR_CLOCK_SHIFTLOAD4_1			0
#define	SR_CLOCK_SHIFTLOAD4_4			1
#define	SR_CLOCK_CLKDIV				3:3
#define	SR_CLOCK_CLKDIV_DIV1			0
#define	SR_CLOCK_CLKDIV_DIV2			1
#define	SR_CLOCK_SHIFTLOAD2			2:2
#define	SR_CLOCK_SHIFTLOAD2_1			0
#define	SR_CLOCK_SHIFTLOAD2_2			1
#define	SR_CLOCK_TXCELLWIDTH			0:0
