/* :ts=8 bk=0
 *
 * tridentdefs.h:	Bit and structure definitions for (some) Trident
 *			chips.
 *
 * Leo L. Schwab					1999.09.30
 *  i740defs.h used as a template.
 *
 * Copyright 1999 Be Incorporated.  Confidential unpublished work.
 * All Rights Reserved.
 */
#ifndef	__TRIDENTDEFS_H
#define	__TRIDENTDEFS_H

#ifndef	__BITTWIDDLE_H
#include "bittwiddle.h"
#endif


/*
 * The stupid-ass VGA "standard" decided to place the same register at
 * different offsets depending on whether you were reading or writing it.
 * These two structures define the correct offsets for reads and writes.
 * Then just specify the correct union when reading or writing, and you'll
 * get the right offset.  Poof!
 */
struct vgaregs_read {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_ST01;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	VGA_AR_ValR;		/*  0x03C1			*/
	vuint8	VGA_ST00;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACState;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	VGA_FCR;		/*  0x03CA			*/
	vuint8	__reserved3;		/*	0x03CB			*/
	vuint8	VGA_Misc;		/*  0x03CC			*/
	vuint8	__reserved4;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved5[0x0004];	/*	0x03D0 - 0x03D3		*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	__reserved6[0x0002];	/*	0x03D6 - 0x03D7		*/
	vuint8	VGA_DestSeg;		/*  0x03D8			*/
	vuint8	VGA_SrcSeg;		/*  0x03D9			*/
	vuint8	VGA_ST01;		/*  0x03DA			*/
	vuint8	VGA_AltClk;		/*  0x03DB			*/
	vuint8	__reserved7[0x0c24];	/*	0x03DC - 0x0FFF		*/
};

struct vgaregs_write {
	vuint8	__reserved0[0x03b4];	/*	0x0000 - 0x03B3		*/
	vuint8	VGAMono_CR_Idx;		/*  0x03B4			*/
	vuint8	VGAMono_CR_Val;		/*  0x03B5			*/
	vuint8	__reserved1[0x0004];	/*	0x03B6 - 0x03B9		*/
	vuint8	VGAMono_FCR;		/*  0x03BA			*/
	vuint8	__reserved2[0x0005];	/*	0x03BB - 0x03BF		*/
	vuint8	VGA_AR_IdxValW;		/*  0x03C0			*/
	vuint8	__reserved3;		/*	0x03C1			*/
	vuint8	VGA_Misc;		/*  0x03C2			*/
	vuint8	VGA_Enable;		/*  0x03C3 (???)		*/
	vuint8	VGA_SR_Idx;		/*  0x03C4			*/
	vuint8	VGA_SR_Val;		/*  0x03C5			*/
	vuint8	VGA_DACMask;		/*  0x03C6			*/
	vuint8	VGA_DACRIdx;		/*  0x03C7			*/
	vuint8	VGA_DACWIdx;		/*  0x03C8			*/
	vuint8	VGA_DACVal;		/*  0x03C9			*/
	vuint8	__reserved4;		/*	0x03CA			*/
	vuint8	__reserved5;		/*	0x03CB			*/
	vuint8	__reserved6;		/*	0x03CC			*/
	vuint8	__reserved7;		/*	0x03CD			*/
	vuint8	VGA_GR_Idx;		/*  0x03CE			*/
	vuint8	VGA_GR_Val;		/*  0x03CF			*/
	vuint8	__reserved8[0x0004];	/*	0x03D0 - 0x03D3		*/
	vuint8	VGA_CR_Idx;		/*  0x03D4			*/
	vuint8	VGA_CR_Val;		/*  0x03D5			*/
	vuint8	__reserved9[0x0002];	/*	0x03D6 - 0x03D7		*/
	vuint8	VGA_DestSeg;		/*  0x03D8			*/
	vuint8	VGA_SrcSeg;		/*  0x03D9			*/
	vuint8	VGA_FCR;		/*  0x03DA			*/
	vuint8	VGA_AltClk;		/*  0x03DB			*/
	vuint8	__reserved10[0x0c24];	/*	0x03DC - 0x0FFF		*/
};
#define	VGA_AR_Idx	VGA_AR_IdxValW
#define	VGA_AR_ValW	VGA_AR_IdxValW


/*
 * Use this union to access the registers based on whether you're reading
 * or writing them.
 */
typedef union vgaregs {
	struct vgaregs_read	r;
	struct vgaregs_write	w;
} vgaregs;


/*
 * Trident 3D Graphics Engine registers.
 */
typedef struct DDDGraphicsEngineRegs {
	vuint32		DDDG_BltSrcStart;	/*  0x00000 - 0x00003	*/
	vuint32		DDDG_BltSrcStop;	/*  0x00004 - 0x00007	*/
	vuint32		DDDG_BltDestStart;	/*  0x00008 - 0x0000B	*/
	vuint32		DDDG_BltDestStop;	/*  0x0000C - 0x0000F	*/
	vuint32		DDDG_RightDispAddr;	/*  0x00010 - 0x00013	*/
	vuint32		DDDG_LeftDispAddr;	/*  0x00014 - 0x00017	*/
	vuint32		DDDG_BlockWriteStartAddr;/*  0x00018 - 0x0001B	*/
	vuint32		DDDG_BlockWriteEndAddr;	/*  0x0001C - 0x0001F	*/
	vuint32		DDDG_Status;		/*  0x00020 - 0x00023	*/
	vuint32		DDDG_Ctl;		/*  0x00024 - 0x00027	*/
	vuint32		DDDG_Debug;		/*  0x00028 - 0x0002B	*/
	vuint32		DDDG_WaitMask;		/*  0x0002C - 0x0002F	*/
	vuint32		DDDG_PrimitiveAttr;	/*  0x00030 - 0x00033	*/
	vuint32		__reserved0[2];		/*  0x00034 - 0x0003C	*/
	vuint32		DDDG_PrimitiveTypeW;	/*  0x0003C - 0x0003F	*/
	vuint32		__reserved1;		/*  0x00040 - 0x00043	*/
	vuint32		DDDG_DrawCmd;		/*  0x00044 - 0x00047	*/
	vuint32		DDDG_ROP;		/*  0x00048 - 0x0004B	*/
	vuint32		DDDG_ZFunc;		/*  0x0004C - 0x0004F	*/
	vuint32		DDDG_TexFunc;		/*  0x00050 - 0x00053	*/
	vuint32		DDDG_ClipWin1;		/*  0x00054 - 0x00057	*/
	vuint32		DDDG_ClipWin2;		/*  0x00058 - 0x0005B	*/
	vuint32		__reserved2;		/*  0x0005C - 0x0005F	*/
	vuint32		DDDG_FGColor;		/*  0x00060 - 0x00063	*/
	vuint32		DDDG_BGColor;		/*  0x00064 - 0x00067	*/
	vuint32		DDDG_ColorKey;		/*  0x00068 - 0x0006B	*/
	vuint32		DDDG_PatternStyle;	/*  0x0006C - 0x0006F	*/
	vuint32		DDDG_PatternColor;	/*  0x00070 - 0x00073	*/
	vuint32		DDDG_FGPatternColor;	/*  0x00074 - 0x00077	*/
	vuint32		DDDG_BGPatternColor;	/*  0x00078 - 0x0007B	*/
	vuint32		DDDG_Alpha;		/*  0x0007C - 0x0007F	*/
	vuint32		DDDG_AlphaFunc;		/*  0x00080 - 0x00083	*/
	vuint32		DDDG_BitMask;		/*  0x00084 - 0x00087	*/
	vuint32		__reserved3[6];		/*  0x00088 - 0x0009F	*/
	vuint32		DDDG_TexCtl;		/*  0x000A0 - 0x000A3	*/
	vuint32		DDDG_TexColor;		/*  0x000A4 - 0x000A7	*/
	vuint32		DDDG_PaletteData;	/*  0x000A8 - 0x000AB	*/
	vuint32		DDDG_TexBoundary;	/*  0x000AC - 0x000AF	*/
	vuint32		__reserved4[2];		/*  0x000B0 - 0x000B7	*/
	vuint32		DDDG_DestStrideBuf0;	/*  0x000B8 - 0x000BB	*/
	vuint32		DDDG_DestStrideBuf1;	/*  0x000BC - 0x000BF	*/
	vuint32		DDDG_DestStrideBuf2;	/*  0x000C0 - 0x000C3	*/
	vuint32		DDDG_DestStrideBuf3;	/*  0x000C4 - 0x000C7	*/
	vuint32		DDDG_SrcStrideBuf0;	/*  0x000C8 - 0x000CB	*/
	vuint32		DDDG_SrcStrideBuf1;	/*  0x000CC - 0x000CF	*/
	vuint32		DDDG_SrcStrideBuf2;	/*  0x000D0 - 0x000D3	*/
	vuint32		DDDG_SrcStrideBuf3;	/*  0x000D4 - 0x000D7	*/
	vuint32		DDDG_ZDepthBuf;		/*  0x000D8 - 0x000DB	*/
	vuint32		DDDG_TexLOD0;		/*  0x000DC - 0x000DF	*/
	vuint32		DDDG_TexLOD1;		/*  0x000E0 - 0x000E3	*/
	vuint32		DDDG_TexLOD2;		/*  0x000E4 - 0x000E7	*/
	vuint32		DDDG_TexLOD3;		/*  0x000E8 - 0x000EB	*/
	vuint32		DDDG_TexLOD4;		/*  0x000EC - 0x000EF	*/
	vuint32		DDDG_TexLOD5;		/*  0x000F0 - 0x000F3	*/
	vuint32		DDDG_TexLOD6;		/*  0x000F4 - 0x000F7	*/
	vuint32		DDDG_TexLOD7;		/*  0x000F8 - 0x000FB	*/
	vuint32		DDDG_TexLOD8;		/*  0x000FC - 0x000FF	*/
} DDDGraphicsEngineRegs;

/*  Changes meaning depending on whether you read or write it.  */
#define	DDDG_SetupStatusR	DDDG_PrimitiveTypeW


/*
 * The rest of the Trident registers.  I haven't settled on all the names yet.
 */
typedef struct TridentRegs {
	/*
	 * Rather than hack up the vgaregs structure, I chose to do things
	 * this way.
	 */
	union {					/*  0x00000 - 0x00FFF	*/
		vgaregs			vga;
		DDDGraphicsEngineRegs	dddg;
	} loregs;

	vuint8		__reserved0[0x1200];	/*  0x01000 - 0x021FF	*/

	/*  Zoomed Video (ZV) / Capture command  */
	vuint32		ZVCaptureCmd;		/*  0x02200 - 0x02203	*/

	/*  PCI Bus Master registers  */
	vuint32		BM_Status;		/*  0x02204 - 0x02207	*/
	vuint8		__reserved1[0x0078];	/*  0x02208 - 0x0227F	*/

	/*  DVD Registers  */
	vuint8		DVD_MC_ID;		/*  0x02280		*/
	vuint8		DVD_MC_Ctl;		/*  0x02281		*/
	vuint8		DVD_MC_FBConfig;	/*  0x02282		*/
	vuint8		__reserved2;		/*  0x02283		*/
	vuint32		DVD_MC_CmdQueue;	/*  0x02284 - 0x02287	*/
	vuint32		DVD_MC_YRefAddr;	/*  0x02288 - 0x0228B	*/
	vuint32		DVD_MC_URefAddr;	/*  0x0228C - 0x0228F	*/
	vuint32		DVD_MC_VRefAddr;	/*  0x02290 - 0x02293	*/
	vuint32		DVD_MC_YDispOffset;	/*  0x02294 - 0x02297	*/
	vuint32		DVD_MC_UDispOffset;	/*  0x02298 - 0x0229B	*/
	vuint32		DVD_MC_VDispOffset;	/*  0x0229C - 0x0229F	*/
	vuint8		DVD_MC_NHMacroblocks;	/*  0x022A0		*/
	vuint8		__reserved3;		/*  0x022A1		*/
	vuint8		DVD_MC_NVMacroblocks;	/*  0x022A2		*/
	vuint8		__reserved4;		/*  0x022A3		*/
	vuint16		DVD_MC_FBYLength;	/*  0x022A4 - 0x022A5	*/
	vuint16		__reserved5;		/*  0x022A6 - 0x022A7	*/
	vuint32		DVD_MC_ColorPalette;	/*  0x022A8 - 0x022AB	*/
	vuint32		__reserved6;		/*  0x022AC - 0x022AF	*/
	vuint32		DVD_SP_Buf0PixAddr;	/*  0x022B0 - 0x022B3	*/
	vuint32		DVD_SP_Buf1PixAddr;	/*  0x022B4 - 0x022B7	*/
	vuint32		DVD_SP_Buf0CmdAddr;	/*  0x022B8 - 0x022BB	*/
	vuint32		DVD_SP_Buf1CmdAddr;	/*  0x022BC - 0x022BF	*/
	vuint16		DVD_SP_YDispOffset;	/*  0x022C0 - 0x022C1	*/
	vuint8		__reserved7[0x000E];	/*  0x022C2 - 0x022CF	*/
	vuint8		DVD_TV_EncoderCtl;	/*  0x022D0		*/
	vuint8		DVD_TV_EncoderCFC[3];	/*  0x022D1 - 0x022D3	*/
	vuint8		__reserved8[0x002C];	/*  0x022D4 - 0x022FF	*/

	/*  PCI Bus Master registers (again)  */
	vuint32		BM_Ctl;			/*  0x02300 - 0x02303	*/
	vuint8		__reserved9[0x000C];	/*  0x02304 - 0x0230F	*/
	vuint32		BM_SysSideStartAddr;	/*  0x02310 - 0x02313	*/
	vuint16		BM_Height;		/*  0x02314 - 0x02315	*/
	vuint16		BM_Width;		/*  0x02316 - 0x02317	*/
	vuint32		BM_FBAddrPitch;		/*  0x02318 - 0x0231B	*/
	vuint16		BM_SysSidePitch;	/*  0x0231C - 0x0231D	*/
	vuint16		__reserved10;		/*  0x0231E - 0x0231F	*/
	vuint32		BM_ClearData;		/*  0x02320 - 0x02323	*/
	vuint8		__reserved11[0x001C];	/*  0x02324 - 0x0233F	*/

	/*  AGP Operation registers  */
	vuint32		AGP_CmdListAddr;	/*  0x02340 - 0x02343	*/
	vuint32		AGP_CmdListSize;	/*  0x02344 - 0x02347	*/
	vuint32		AGP_Ch1_FBAddrPitch;	/*  0x02348 - 0x0234B	*/
	vuint32		AGP_Ch1_FBSize;		/*  0x0234C - 0x0234F	*/
	vuint32		AGP_Ch1_SysAddr;	/*  0x02350 - 0x02353	*/
	vuint32		AGP_Ch12_SysSidePitch;	/*  0x02354 - 0x02357	*/
	vuint32		AGP_Ch2_SysAddr;	/*  0x02358 - 0x0235B	*/
	vuint32		AGP_Ch2_FBAddrPitch;	/*  0x0235C - 0x0235F	*/
	vuint32		AGP_Ch2_FBSize;		/*  0x02360 - 0x02363	*/
	vuint32		AGP_CounterThreshhold;	/*  0x02364 - 0x02367	*/
	vuint32		AGP_IOCtl;		/*  0x02368 - 0x0236B	*/
	vuint32		AGP_Ch2Ctl;		/*  0x0236C - 0x0236F	*/
	vuint32		AGP_CmdChStatus;	/*  0x02370 - 0x02373	*/
	vuint8		__reserved12[0x003C];	/*  0x02374 - 0x023AF	*/
	vuint32		AGP_CmdBufStart;	/*  0x023B0 - 0x023B3	*/
	vuint32		AGP_CmdBufEnd;		/*  0x023B4 - 0x023B7	*/
	vuint8		__reserved13[0x0048];	/*  0x023B8 - 0x023FF	*/

	vuint8		__reserved14[0xDC00];	/*  0x02400 - 0x0FFFF	*/
	
	/*  3D Graphics Engine  */
	vuint32		DDDG_DataPort[0x4000];	/*  0x10000 - 0x1FFFF	*/
} TridentRegs;

/*  This register is schizophrenic  */
#define	DVD_MC_Status	DVD_MC_CmdQueue


/*****************************************************************************
 * "Standard" VGA register indices and bit definitions.
 ****
 * Sequencer bit and index definitions
 * I've decided to use the XFree86/NVidia bit definition form, even though
 * it makes the use of ctags difficult.
 */
#define	SR_RESET				0x00
#define	SR_RESET_SYNC				1:1
#define	SR_RESET_SYNC_ENABLE			0
#define	SR_RESET_SYNC_DISABLE			1
#define	SR_RESET_ASYNC				0:0
#define	SR_RESET_ASYNC_ENABLE			0
#define	SR_RESET_ASYNC_DISABLE			1

#define	SR_CLOCK				0x01
#define	SR_CLOCK_VIDDISABLE			5:5
#define	SR_CLOCK_SHIFTLOAD4			4:4
#define	SR_CLOCK_SHIFTLOAD4_1			0
#define	SR_CLOCK_SHIFTLOAD4_4			1
#define	SR_CLOCK_CLKDIV				3:3
#define	SR_CLOCK_CLKDIV_DIV1			0
#define	SR_CLOCK_CLKDIV_DIV2			1
#define	SR_CLOCK_SHIFTLOAD2			2:2
#define	SR_CLOCK_SHIFTLOAD2_1			0
